freeshelf_1_app/app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    if @book.save
---
INSERT INTO "books" ("title", "description", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Look Homeward Angel"], ["description", "A great read"], ["url", "www.google.com"], ["created_at", "2018-05-22 20:09:57.869695"], ["updated_at", "2018-05-22 20:09:57.869695"]]