freeshelf_1_app/app/views/books/index.html.erb

      <td><%= book.title %></td>
      <td><%= book.author_ids.pluck(:name).join(', ') %></td>
---
SELECT "authors"."name" FROM "authors" INNER JOIN "book_authors" ON "authors"."id" = "book_authors"."author_id" WHERE "book_authors"."book_id" = $1  [["book_id", 14]]