freeshelf_1_app/app/views/checkout/show.html.erb

SELECT "authors"."name" FROM "authors" INNER JOIN "book_authors" ON "authors"."id" = "book_authors"."author_id" WHERE "book_authors"."book_id" = $1  [["book_id", 24]]
---
<strong>Author:</strong>
<%= @book.authors.pluck(:name).join(', ') %>